; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v2 - type_3 ?v6 - type_1)
 	      (pred_1 ?v3 - object ?v6 - type_1)
	      (pred_2 ?v2 - type_3 ?v5 - type_2)
	      (pred_4 ?v2 - type_3 ?v3 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v2 - type_3 ?v8 ?v4 - type_1)
       :precondition (and  (pred_3 ?v2 ?v8))
       :effect (and  (pred_3 ?v2 ?v4)
		     (not (pred_3 ?v2 ?v8))))

   (:action op_1
       :parameters (?v2 - type_3 ?v1 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v7) (pred_3 ?v2 ?v7) (pred_2 ?v2 ?v5))
       :effect (and (pred_4 ?v2 ?v1 ?v5)
		    (not (pred_1 ?v1 ?v7)) 
		    (not (pred_2 ?v2 ?v5))))

   (:action op_2
       :parameters (?v2 - type_3 ?v1 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v1 ?v5) (pred_3 ?v2 ?v7))
       :effect (and (pred_1 ?v1 ?v7)
		    (pred_2 ?v2 ?v5)
		    (not (pred_4 ?v2 ?v1 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_12 - type_3
obj_04 obj_13 obj_10 obj_07 - type_2
obj_05 obj_01 obj_09 obj_03 - type_1
obj_08 obj_02 obj_06 - object)
(:init
(pred_3 obj_11 obj_03)
(pred_2 obj_11 obj_04)
(pred_2 obj_11 obj_13)
(pred_3 obj_12 obj_05)
(pred_2 obj_12 obj_10)
(pred_2 obj_12 obj_07)
(pred_1 obj_08 obj_01)
(pred_1 obj_02 obj_09)
(pred_1 obj_06 obj_03)
)
(:goal
(and
(pred_1 obj_08 obj_05)
(pred_1 obj_02 obj_09)
(pred_1 obj_06 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_11 obj_05) (pred_3 obj_12 obj_05))))
  )
)
)

; plan
1. (op_1 obj_11 obj_06 obj_03 obj_13)
   deleted: (pred_1 obj_06 obj_03) (pred_2 obj_11 obj_13)
   added: (pred_4 obj_11 obj_06 obj_13)
   goals met: 1 of 3
2. (op_3 obj_12 obj_05 obj_01)
   deleted: (pred_3 obj_12 obj_05)
   added: (pred_3 obj_12 obj_01)
   goals met: 1 of 3
3. (op_3 obj_11 obj_03 obj_01)
   deleted: (pred_3 obj_11 obj_03)
   added: (pred_3 obj_11 obj_01)
   goals met: 1 of 3
4. (op_1 obj_11 obj_08 obj_01 obj_04)
   deleted: (pred_1 obj_08 obj_01) (pred_2 obj_11 obj_04)
   added: (pred_4 obj_11 obj_08 obj_04)
   goals met: 1 of 3
5. (op_3 obj_11 obj_01 obj_05)
   deleted: (pred_3 obj_11 obj_01)
   added: (pred_3 obj_11 obj_05)
   goals met: 1 of 3
6. (op_2 obj_11 obj_06 obj_05 obj_13)
   deleted: (pred_4 obj_11 obj_06 obj_13)
   added: (pred_1 obj_06 obj_05) (pred_2 obj_11 obj_13)
   goals met: 2 of 3
7. (op_2 obj_11 obj_08 obj_05 obj_04)
   deleted: (pred_4 obj_11 obj_08 obj_04)
   added: (pred_1 obj_08 obj_05) (pred_2 obj_11 obj_04)
   goals met: 3 of 3
